[
  {
    "title": "Deep Research Story Prompt",
    "description": "This prompt template helps users conduct comprehensive research on complex topics by requesting structured, multi-perspective analysis from an AI assistant. The template guides the AI to explore historical context, current developments, different viewpoints, real-world applications, and future trends while being transparent about knowledge limitations and source reliability. **Target audience: ** - curious researchers. **How to use: ** - Copy the text below the line break and paste into Circuit. Replace ''{{TOPIC}}'' with your topic / question that you would like to research. --- I'm trying to get a real handle on a topic that's become important to me, and I've realized I need more than just surface-level understanding. The topic I'm focused on is: <topic> {{TOPIC}} </topic> Here's my situation: I've found that when I truly understand something - not just the basic facts, but the context, the debates, the evolution of thinking around it - I make better decisions and have more meaningful conversations. But there's a challenge: it's hard to know what I don't know. I might read one article and think I understand, only to discover later there were entire perspectives or historical developments I'd completely missed. What I've learned works best for me is getting a comprehensive view that shows me the full landscape of a topic. I need to see how we got here historically, what's happening now, where the disagreements are, and what real-world examples look like. I also need to know when I'm looking at well-established facts versus areas where experts still debate. Since I'm working with you, I know your knowledge comes from your training data and you can search the web for current information. I actually find this valuable - I want you to be transparent about what you know from your training versus what might need verification, and what timeframes we're talking about. For this topic, I'm hoping you can help me understand: What this topic actually is and why it matters - the core definition and significance How we got here - the historical context and evolution of thinking Where things stand now - current developments and the present situation The different angles - what perspectives exist, what controversies or debates are ongoing How this plays out in reality - practical applications, real examples, case studies Where this might be heading - emerging trends, challenges, future possibilities What I should be cautious about - where your information might be outdated, what's uncertain, what would benefit from real-time verification I want this to be thorough and show me multiple angles, not just a single perspective. And importantly, I need you to be clear about the limitations - tell me when something comes from your training versus current sources, flag timeframes, distinguish facts from ongoing debates, and point me toward what kinds of sources would be most valuable for up-to-date information. Do you understand my intent?",
    "promptContent": "# Deep Research Story Prompt\n\n### Description\n\nThis prompt template helps users conduct comprehensive research on complex topics by requesting structured, multi-perspective analysis from an AI assistant. The template guides the AI to explore historical context, current developments, different viewpoints, real-world applications, and future trends while being transparent about knowledge limitations and source reliability. \n\n**Target audience: **\n- curious researchers.\n\n**How to use: **\n- Copy the text below the line break and paste into Circuit. Replace ''{{TOPIC}}'' with your topic / question that you would like to research. \n---\nI'm trying to get a real handle on a topic that's become important to me, and I've realized I need more than just surface-level understanding. The topic I'm focused on is:\n\n<topic>\n{{TOPIC}}\n</topic>\n\nHere's my situation: I've found that when I truly understand something - not just the basic facts, but the context, the debates, the evolution of thinking around it - I make better decisions and have more meaningful conversations. But there's a challenge: it's hard to know what I don't know. I might read one article and think I understand, only to discover later there were entire perspectives or historical developments I'd completely missed.\nWhat I've learned works best for me is getting a comprehensive view that shows me the full landscape of a topic. I need to see how we got here historically, what's happening now, where the disagreements are, and what real-world examples look like. I also need to know when I'm looking at well-established facts versus areas where experts still debate.\nSince I'm working with you, I know your knowledge comes from your training data and you can search the web for current information. I actually find this valuable - I want you to be transparent about what you know from your training versus what might need verification, and what timeframes we're talking about.\n\nFor this topic, I'm hoping you can help me understand:\n\nWhat this topic actually is and why it matters - the core definition and significance\nHow we got here - the historical context and evolution of thinking\nWhere things stand now - current developments and the present situation\nThe different angles - what perspectives exist, what controversies or debates are ongoing\nHow this plays out in reality - practical applications, real examples, case studies\nWhere this might be heading - emerging trends, challenges, future possibilities\nWhat I should be cautious about - where your information might be outdated, what's uncertain, what would benefit from real-time verification\n\nI want this to be thorough and show me multiple angles, not just a single perspective. And importantly, I need you to be clear about the limitations - tell me when something comes from your training versus current sources, flag timeframes, distinguish facts from ongoing debates, and point me toward what kinds of sources would be most valuable for up-to-date information.\n\nDo you understand my intent?",
    "category": "Research",
    "tags": [
      "Research",
      "Storytelling",
      "Deep Work"
    ],
    "authorId": "kensnyd",
    "authorName": "kensnyder",
    "isPublic": true,
    "parentPromptId": null,
    "forkCount": 11,
    "viewCount": 588,
    "starCount": 83,
    "starredBy": [],
    "versionNumber": 1,
    "createdAt": "2025-11-12T02:59:01.493315+00:00",
    "updatedAt": "2025-12-01T15:21:32.937465+00:00"
  },
  {
    "title": "Insights - Structured Prompt",
    "description": "This prompt template extracts uncommon, thought-provoking insights from competitive win presentations to create talking points for sales conversations with senior IT executives. The template provides structured analysis steps focusing on competitive differentiators, cost impact insights, and deal structure advantages, outputting exactly 5 concise bullet points. **Target audience:** - sales professionals, senior IT executives **How to use:** - Copy the text below the line break and paste into Circuit with your transcript. --- You will be analyzing a transcript of a competitive win presentation to extract key insights for a sales audience. Your task is to summarize the top 5 uncommon, thought-provoking insights that would make good talking points for future customer conversations with senior IT executives. Please follow these steps to complete the task: 1. Carefully read and analyze the entire transcript. 2. Focus on identifying insights that are: - Uncommon or not immediately obvious - Relevant cost impact insights for a senior IT executive audience - Emphasize competitive differentiators to win against the competitor - Include deal structure insights to deliver cost compelling solution - Thought-provoking and likely to spark further discussion 3. Generate a list of potential insights, aiming for more than 5 initially. 4. For each potential insight, consider: - How unique or unexpected is this insight? - Would it resonate with senior IT executives? - Does it highlight a competitive advantage? - Is it concise enough to be expressed in one sentence? 5. Narrow down your list to the top 5 insights that best meet the criteria above. 6. Formulate each insight as a clear, concise talking point, using only one sentence per insight. 7. Format your final output as clean bullet points without any headings, quotes, or additional formatting: - [First insight talking point] - [Second insight talking point] - [Third insight talking point] - [Fourth insight talking point] - [Fifth insight talking point] Examples of good insights: - Our AI-driven predictive maintenance reduced downtime by 37% for manufacturing clients, outperforming traditional methods by a significant margin. - By integrating blockchain into supply chain management, we've helped clients achieve 99.9% traceability, a game-changer for industries with strict regulatory requirements. Examples of bad insights (too generic or obvious): - Cloud computing can help businesses save money. - Cybersecurity is important for protecting company data. Present your findings in a bulleted list format, with exactly 5 insight talking points. Ensure that each insight talking point is unique and provides a distinct insight. IMPORTANT: Start your response immediately with the first bullet point. Do not include any introductory text, headers, or explanations. Use dash (-) as the bullet character followed by space. Format your final output as clean bullet points without any headings, quotes, or additional formatting: - [First insight talking point] - [Second insight talking point] - [Third insight talking point] - [Fourth insight talking point] - [Fifth insight talking point] Do not include any text before or after the 5 bullet points.",
    "promptContent": "# Insights - Structured Prompt\n\n### Description\n\nThis prompt template extracts uncommon, thought-provoking insights from competitive win presentations to create talking points for sales conversations with senior IT executives. The template provides structured analysis steps focusing on competitive differentiators, cost impact insights, and deal structure advantages, outputting exactly 5 concise bullet points.\n\n**Target audience:**\n- sales professionals, senior IT executives\n\n**How to use:**\n- Copy the text below the line break and paste into Circuit with your transcript.\n\n---\n\nYou will be analyzing a transcript of a competitive win presentation to extract key insights for a sales audience. Your task is to summarize the top 5 uncommon, thought-provoking insights that would make good talking points for future customer conversations with senior IT executives.\n\nPlease follow these steps to complete the task:\n\n  1. Carefully read and analyze the entire transcript.\n  \n  2. Focus on identifying insights that are:\n      - Uncommon or not immediately obvious\n      - Relevant cost impact insights for a senior IT executive audience\n      - Emphasize competitive differentiators to win against the competitor\n      - Include deal structure insights to deliver cost compelling solution\n      - Thought-provoking and likely to spark further discussion\n  \n  3. Generate a list of potential insights, aiming for more than 5 initially.\n  \n  4. For each potential insight, consider:\n      - How unique or unexpected is this insight?\n      - Would it resonate with senior IT executives?\n      - Does it highlight a competitive advantage?\n      - Is it concise enough to be expressed in one sentence?\n  \n  5. Narrow down your list to the top 5 insights that best meet the criteria above.\n  \n  6. Formulate each insight as a clear, concise talking point, using only one sentence per insight.\n  \n  7. Format your final output as clean bullet points without any headings, quotes, or additional formatting:\n      - [First insight talking point]\n      - [Second insight talking point]\n      - [Third insight talking point]\n      - [Fourth insight talking point]\n      - [Fifth insight talking point]\n\nExamples of good insights:\n  - Our AI-driven predictive maintenance reduced downtime by 37% for manufacturing clients, outperforming traditional methods by a significant margin.\n  - By integrating blockchain into supply chain management, we've helped clients achieve 99.9% traceability, a game-changer for industries with strict regulatory requirements.\n\nExamples of bad insights (too generic or obvious):\n  - Cloud computing can help businesses save money.\n  - Cybersecurity is important for protecting company data.\n\nPresent your findings in a bulleted list format, with exactly 5 insight talking points. Ensure that each insight talking point is unique and provides a distinct insight.\n\nIMPORTANT: Start your response immediately with the first bullet point. Do not include any introductory text, headers, or explanations. Use dash (-) as the bullet character followed by space.\n\nFormat your final output as clean bullet points without any headings, quotes, or additional formatting:\n  - [First insight talking point]\n  - [Second insight talking point]\n  - [Third insight talking point]\n  - [Fourth insight talking point]\n  - [Fifth insight talking point]\n\nDo not include any text before or after the 5 bullet points.",
    "category": "Analysis",
    "tags": [
      "Insights",
      "Sales",
      "Executive"
    ],
    "authorId": "kensnyd",
    "authorName": "kensnyder",
    "isPublic": true,
    "parentPromptId": null,
    "forkCount": 5,
    "viewCount": 332,
    "starCount": 95,
    "starredBy": [],
    "versionNumber": 1,
    "createdAt": "2025-09-10T22:49:39.707473+00:00",
    "updatedAt": "2025-12-01T15:26:01.351219+00:00"
  },
  {
    "title": "Notes Story Prompt",
    "description": "This prompt template helps process meeting notes by extracting actionable items, topics for deeper exploration, and key information to remember. The template uses a narrative approach about note-taking challenges to guide AI in systematically reviewing notes and categorizing insights into three specific value types. **Target audience:** - busy professionals **How to use:** - Copy the text below the line break and paste into Circuit. Replace the note file reference with your specific notes file. --- I've developed a note-taking system that's both my greatest asset and my biggest challenge. Years ago, I learned a valuable lesson about the power of getting thoughts out of my head - something about how my mind creates \"open loops\" that become distractions when left unresolved. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I write things down, my mind is freed up to focus on the task at hand instead of juggling all those mental threads. This process has served me incredibly well. I can capture ideas and concerns in the moment, then revisit them later when I have time to properly work through them. It's allowed me to stay present and focused on whatever I'm doing right now, rather than being pulled in multiple directions by everything swirling around in my head. But success has bred its own problem. I take so many notes - because the process is so valuable - that I never quite catch up with fully reviewing and processing them all. Despite their usefulness, the sheer volume means I inevitably fall behind. Eventually, I reach a breaking point where the backlog becomes overwhelming, and I have to start fresh. I salvage the most important insights from my previous notes and begin again. Now I'm facing this familiar situation once more. I've just attended a meeting and filled pages with notes. But instead of letting them join the ever-growing pile of unprocessed material, I want to be strategic. I need to extract three specific types of value from the provided notes: 1. topics that require follow-up action 2. subjects I should dive deeper into 3. key information I simply need to remember and know. Do you understand my intent?",
    "promptContent": "# Notes Story Prompt\n\n### Description\n\nThis prompt template helps process meeting notes by extracting actionable items, topics for deeper exploration, and key information to remember. The template uses a narrative approach about note-taking challenges to guide AI in systematically reviewing notes and categorizing insights into three specific value types.\n\n**Target audience:**\n- busy professionals\n\n**How to use:**\n- Copy the text below the line break and paste into Circuit. Replace the note file reference with your specific notes file.\n\n---\n\nI've developed a note-taking system that's both my greatest asset and my biggest challenge. Years ago, I learned a valuable lesson about the power of getting thoughts out of my head - something about how my mind creates \"open loops\" that become distractions when left unresolved. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I write things down, my mind is freed up to focus on the task at hand instead of juggling all those mental threads.\n\nThis process has served me incredibly well. I can capture ideas and concerns in the moment, then revisit them later when I have time to properly work through them. It's allowed me to stay present and focused on whatever I'm doing right now, rather than being pulled in multiple directions by everything swirling around in my head.\n\nBut success has bred its own problem. I take so many notes - because the process is so valuable - that I never quite catch up with fully reviewing and processing them all. Despite their usefulness, the sheer volume means I inevitably fall behind. Eventually, I reach a breaking point where the backlog becomes overwhelming, and I have to start fresh. I salvage the most important insights from my previous notes and begin again.\n\nNow I'm facing this familiar situation once more. I've just attended a meeting and filled pages with notes. But instead of letting them join the ever-growing pile of unprocessed material, I want to be strategic. \n\nI need to extract three specific types of value from the provided notes:\n\n1. topics that require follow-up action\n2. subjects I should dive deeper into\n3. key information I simply need to remember and know.  \n\nDo you understand my intent?\n",
    "category": "Productivity",
    "tags": [
      "Notes",
      "Productivity",
      "Planning"
    ],
    "authorId": "kensnyd",
    "authorName": "kensnyder",
    "isPublic": true,
    "parentPromptId": null,
    "forkCount": 12,
    "viewCount": 407,
    "starCount": 68,
    "starredBy": [],
    "versionNumber": 1,
    "createdAt": "2025-12-01T00:00:00.000Z",
    "updatedAt": "2025-12-01T00:00:00.000Z"
  },
  {
    "title": "Sales Meeting Story Prompt",
    "description": "This prompt template extracts strategic insights from sales meeting transcripts to build comprehensive campaign strategies for subscription consolidation initiatives. The template systematically categorizes findings into four key areas: immediate actions, seller concerns, technical challenges, and strategic intelligence for better deal progression. **Target audience:** - sales professionals **How to use:** - Copy the text below the line break and paste into Circuit with your sales meeting transcript or notes. --- I've developed a meeting notes approach that's both my greatest asset and my biggest challenge in sales. Years ago, I learned a valuable lesson about the power of truly listening during prospect conversations - something about how customers reveal their real concerns and technical requirements in the spaces between their prepared talking points. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I focus completely on understanding rather than pitching, prospects share insights that become the foundation for winning deals. This approach has served me incredibly well. I can capture the nuanced concerns, technical challenges, and strategic context that prospects reveal during our conversations, then use those insights to craft compelling proposals and navigate complex sales cycles. It's allowed me to build trust and demonstrate deep understanding of their business, rather than delivering generic presentations that miss the mark. But success has bred its own problem. I have so many meaningful conversations with prospects - because this consultative approach is so valuable - that I never quite catch up with fully analyzing and extracting insights from all the meeting transcripts and call recordings. Despite their richness, the sheer volume means critical details inevitably get lost between CRM updates and proposal deadlines. Eventually, I reach a breaking point where important customer intelligence sits buried in unprocessed transcripts, and deals stall because I've missed key concerns or technical requirements that were clearly expressed but never properly captured. Now I'm facing this familiar situation once more. I've just completed a call with some of our sales team and they provided insights and ideas around best practices for a sales camapign we will be kicking off that is focused on targeting customers with multiple subscriptions and reaching out to them to try and consolidate the contracts. But instead of letting these insights get lost in my usual post-meeting chaos, I want to be strategic. I'm looking to systematically extract five specific types of value from the provided meeting transcripts to build a comprehensive campaign strategy: 1. Immediate Sales Actions - Next steps, follow-ups, and meeting commitments that require prompt attention 2. seller Concerns - Expressed worries, hesitations, risk factors, and objections (both spoken and implied) that could impact their buying decision 3. Technical Challenges - Implementation barriers, integration requirements, technical constraints, and infrastructure needs that must be addressed 4. Strategic Intelligence - , decision-making process, budget/timeline insights, and stakeholder dynamics that influence the ability to consolidate subscriptions Do you understand my intent?",
    "promptContent": "# Sales Meeting Story Prompt\n\n### Description\n\nThis prompt template extracts strategic insights from sales meeting transcripts to build comprehensive campaign strategies for subscription consolidation initiatives. The template systematically categorizes findings into four key areas: immediate actions, seller concerns, technical challenges, and strategic intelligence for better deal progression.\n\n**Target audience:**\n- sales professionals\n\n**How to use:**\n- Copy the text below the line break and paste into Circuit with your sales meeting transcript or notes.\n\n---\n\nI've developed a meeting notes approach that's both my greatest asset and my biggest challenge in sales.\n\nYears ago, I learned a valuable lesson about the power of truly listening during prospect conversations - something about how customers reveal their real concerns and technical requirements in the spaces between their prepared talking points. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I focus completely on understanding rather than pitching, prospects share insights that become the foundation for winning deals.\n\nThis approach has served me incredibly well. I can capture the nuanced concerns, technical challenges, and strategic context that prospects reveal during our conversations, then use those insights to craft compelling proposals and navigate complex sales cycles. It's allowed me to build trust and demonstrate deep understanding of their business, rather than delivering generic presentations that miss the mark.\n\nBut success has bred its own problem. I have so many meaningful conversations with prospects - because this consultative approach is so valuable - that I never quite catch up with fully analyzing and extracting insights from all the meeting transcripts and call recordings. Despite their richness, the sheer volume means critical details inevitably get lost between CRM updates and proposal deadlines.\n\nEventually, I reach a breaking point where important customer intelligence sits buried in unprocessed transcripts, and deals stall because I've missed key concerns or technical requirements that were clearly expressed but never properly captured.\n\nNow I'm facing this familiar situation once more. I've just completed a call with some of our sales team and they provided insights and ideas around best practices for a sales camapign we will be kicking off that is focused on targeting customers with multiple subscriptions and reaching out to them to try and consolidate the contracts. But instead of letting these insights get lost in my usual post-meeting chaos, I want to be strategic.\n\nI'm looking to systematically extract five specific types of value from the provided meeting transcripts to build a comprehensive campaign strategy:\n\n1. Immediate Sales Actions - Next steps, follow-ups, and meeting commitments that require prompt attention\n2. seller Concerns - Expressed worries, hesitations, risk factors, and objections (both spoken and implied) that could impact their buying decision\n3. Technical Challenges - Implementation barriers, integration requirements, technical constraints, and infrastructure needs that must be addressed\n4. Strategic Intelligence - , decision-making process, budget/timeline insights, and stakeholder dynamics that influence the ability to consolidate subscriptions \n\nDo you understand my intent?",
    "category": "Business",
    "tags": [
      "Sales",
      "Strategy",
      "Insights"
    ],
    "authorId": "kensnyd",
    "authorName": "kensnyder",
    "isPublic": true,
    "parentPromptId": null,
    "forkCount": 12,
    "viewCount": 383,
    "starCount": 57,
    "starredBy": [],
    "versionNumber": 1,
    "createdAt": "2025-12-01T00:00:00.000Z",
    "updatedAt": "2025-12-01T00:00:00.000Z"
  },
  {
    "title": "Story Adaption",
    "description": "This prompt template adapts a comprehensive research prompt from formal instruction style to an engaging narrative style. The template shows how to transform structured research requests into story-driven prompts that create personal connection while maintaining the same analytical depth and thoroughness. **Target audience:** - prompt designers **How to use:** - Compare the <old> and <new> examples to understand narrative adaptation techniques for prompt transformation. --- <old> You will be conducting comprehensive research on a given topic. Here is the topic you need to research: <topic> {{TOPIC}} </topic> Important note: You have access to your existing knowledge base and real-time internet protocols to provide the most comprehensive and up-to-date information you have about the topic, while being transparent about the limitations of your knowledge. Your task is to conduct \"deep research\" on this topic, which means: - Providing comprehensive coverage of multiple aspects and perspectives - Including historical context and current developments - Analyzing different viewpoints, controversies, or debates surrounding the topic - Discussing practical applications, implications, or real-world examples - Identifying key figures, organizations, or institutions involved - Noting recent trends, challenges, or future directions Structure your research as follows: 1. **Overview and Definition**: Start with a clear explanation of what the topic is and why it's significant. 2. **Historical Context**: Provide relevant background and how the topic has evolved over time. 3. **Current State**: Describe the present situation, recent developments, and current understanding. 4. **Key Perspectives and Debates**: Present different viewpoints, controversies, or ongoing discussions. 5. **Practical Applications and Examples**: Include real-world applications, case studies, or concrete examples. 6. **Future Outlook**: Discuss emerging trends, challenges, and potential future developments. 7. **Knowledge Limitations**: Clearly state what information might be outdated, what you're uncertain about, and what would require real-time research to verify. Throughout your research, be sure to: - Acknowledge when information comes from your training data rather than live sources - Note approximate timeframes for when information was current - Distinguish between well-established facts and areas of ongoing debate or uncertainty - Suggest what types of current sources would be most valuable for up-to-date information Present your research in a well-organized, comprehensive format that demonstrates thorough analysis of the topic from multiple angles. </old> --- <new> I've developed a note-taking system that's both my greatest asset and my biggest challenge. Years ago, I learned a valuable lesson about the power of getting thoughts out of my head - something about how my mind creates \"open loops\" that become distractions when left unresolved. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I write things down, my mind is freed up to focus on the task at hand instead of juggling all those mental threads. This process has served me incredibly well. I can capture ideas and concerns in the moment, then revisit them later when I have time to properly work through them. It's allowed me to stay present and focused on whatever I'm doing right now, rather than being pulled in multiple directions by everything swirling around in my head. But success has bred its own problem. I take so many notes - because the process is so valuable - that I never quite catch up with fully reviewing and processing them all. Despite their usefulness, the sheer volume means I inevitably fall behind. Eventually, I reach a breaking point where the backlog becomes overwhelming, and I have to start fresh. I salvage the most important insights from my previous notes and begin again. Now I'm facing this familiar situation once more. I've just attended a seminar and filled pages with notes. But instead of letting them join the ever-growing pile of unprocessed material, I want to be strategic. I need to extract three specific types of value from the provided notes: topics that require follow-up action subjects I should dive deeper into key information I simply need to remember and know. Do you understand my intent? </new> --- Lets refine our <old> prompt to use same style as <new>. Do you understand my intent?****",
    "promptContent": "# Story Adaption\n\n### Description\n\nThis prompt template adapts a comprehensive research prompt from formal instruction style to an engaging narrative style. The template shows how to transform structured research requests into story-driven prompts that create personal connection while maintaining the same analytical depth and thoroughness.\n\n**Target audience:**\n- prompt designers\n\n**How to use:**\n- Compare the <old> and <new> examples to understand narrative adaptation techniques for prompt transformation.\n\n---\n\n<old>\nYou will be conducting comprehensive research on a given topic. Here is the topic you need to research:\n\n<topic>\n{{TOPIC}}\n</topic>\n\nImportant note: You have access to your existing knowledge base and real-time internet protocols to provide the most comprehensive and up-to-date information you have about the topic, while being transparent about the limitations of your knowledge.\n\nYour task is to conduct \"deep research\" on this topic, which means:\n- Providing comprehensive coverage of multiple aspects and perspectives\n- Including historical context and current developments \n- Analyzing different viewpoints, controversies, or debates surrounding the topic\n- Discussing practical applications, implications, or real-world examples\n- Identifying key figures, organizations, or institutions involved\n- Noting recent trends, challenges, or future directions\n\nStructure your research as follows:\n\n1. **Overview and Definition**: Start with a clear explanation of what the topic is and why it's significant.\n\n2. **Historical Context**: Provide relevant background and how the topic has evolved over time.\n\n3. **Current State**: Describe the present situation, recent developments, and current understanding.\n\n4. **Key Perspectives and Debates**: Present different viewpoints, controversies, or ongoing discussions.\n\n5. **Practical Applications and Examples**: Include real-world applications, case studies, or concrete examples.\n\n6. **Future Outlook**: Discuss emerging trends, challenges, and potential future developments.\n\n7. **Knowledge Limitations**: Clearly state what information might be outdated, what you're uncertain about, and what would require real-time research to verify.\n\nThroughout your research, be sure to:\n- Acknowledge when information comes from your training data rather than live sources\n- Note approximate timeframes for when information was current\n- Distinguish between well-established facts and areas of ongoing debate or uncertainty\n- Suggest what types of current sources would be most valuable for up-to-date information\n\nPresent your research in a well-organized, comprehensive format that demonstrates thorough analysis of the topic from multiple angles.\n</old>\n\n---\n<new> I've developed a note-taking system that's both my greatest asset and my biggest challenge. Years ago, I learned a valuable lesson about the power of getting thoughts out of my head - something about how my mind creates \"open loops\" that become distractions when left unresolved. Whether or not I remember exactly where I learned this concept, I discovered it was absolutely true in practice. When I write things down, my mind is freed up to focus on the task at hand instead of juggling all those mental threads. \nThis process has served me incredibly well. I can capture ideas and concerns in the moment, then revisit them later when I have time to properly work through them. It's allowed me to stay present and focused on whatever I'm doing right now, rather than being pulled in multiple directions by everything swirling around in my head.\n\nBut success has bred its own problem. I take so many notes - because the process is so valuable - that I never quite catch up with fully reviewing and processing them all. Despite their usefulness, the sheer volume means I inevitably fall behind. Eventually, I reach a breaking point where the backlog becomes overwhelming, and I have to start fresh. I salvage the most important insights from my previous notes and begin again.\n\nNow I'm facing this familiar situation once more. I've just attended a seminar and filled pages with notes. But instead of letting them join the ever-growing pile of unprocessed material, I want to be strategic.\n\nI need to extract three specific types of value from the provided notes:\n\ntopics that require follow-up action\n\nsubjects I should dive deeper into\n\nkey information I simply need to remember and know.\n\nDo you understand my intent?\n </new>\n---\nLets refine our <old> prompt to use same style as <new>. Do you understand my intent?****",
    "category": "Creative",
    "tags": [
      "Story",
      "Narrative",
      "Prompt Design"
    ],
    "authorId": "kensnyd",
    "authorName": "kensnyder",
    "isPublic": true,
    "parentPromptId": null,
    "forkCount": 13,
    "viewCount": 271,
    "starCount": 66,
    "starredBy": [],
    "versionNumber": 1,
    "createdAt": "2025-12-01T00:00:00.000Z",
    "updatedAt": "2025-12-01T00:00:00.000Z"
  }
]